package itProger.basics.informationOutput;

public class FirstAndLastNameOutput {
    public static void main(String[] args) {
        //Выведите своё имя и фамилию в консоль. Сделайте чтобы фамилия вывелась с пропуском 4 пустых линий
        // после имени.
        System.out.println("Vera\n\n\n\n\nRiefert");
        System.out.println("Vera");
        System.out.println(" ");
        System.out.println(" ");
        System.out.println(" ");
        System.out.println(" ");// Всего четыре строчки, так как 5 отступ создался первой строкой
        System.out.println("Riefert");


    }
}
